engineer-ae3o/stm32-hal-library/components/drivers/src/adc.c
// Control of all the ADC instances
void adc_clk_configure(adc_prescaler_t clk_prescaler) {
    // Set the ADC clock prescaler
    ADC->CCR &= ~ADC_CCR_ADCPRE;
    ADC->CCR |= ((uint32_t)clk_prescaler << ADC_CCR_ADCPRE_Pos);
}

void adc_enable_nvic_irq(bool enable) {
    if (enable) {
        NVIC_SetPriority(ADC_IRQn, ADC_DMA_NVIC_IRQ_PRIORITY);
        NVIC_EnableIRQ(ADC_IRQn);
    } else {
        NVIC_DisableIRQ(ADC_IRQn);
    }
}

void adc_power_on_temp_sensor(bool on) {
    if (on) {
        ADC->CCR |= ADC_CCR_TSVREFE;
        delay_us(TEMP_SENSOR_STARUP_TIME_US);
    } else {
        ADC->CCR &= ~ADC_CCR_TSVREFE;
    }
}


// For use with the regular group and external channels in polling oneshot mode
hal_err_t adc_regular_group_get_oneshot(ADC_TypeDef* handle, adc_channels_t channel, uint16_t* raw_data) {
    if (handle == NULL || raw_data == NULL) {
        return HAL_ERR_INVALID_ARG;
    }

    // Get the raw ADC data
    const uint16_t raw = oneshot_regular_group(handle, channel);
    if (raw == UINT16_MAX) {
        return HAL_ERR_TIMEOUT;
    }

    *raw_data = raw;
    return HAL_OK;
}


// For use with the regular group and external channels in DMA continuous sampling mode
hal_err_t adc_regular_group_cont_start_conv(ADC_TypeDef* handle, const adc_continuous_config_t* config) {
    if (handle == NULL || config == NULL || config->channels.channels_sequence == NULL || config->channels.num_of_channels == 0 ||
        config->channels.num_of_channels > MAX_REGULAR_CHANNELS || config->buffer_1 == NULL ||
        (config->use_double_buffers && config->buffer_2 == NULL)) {
        return HAL_ERR_INVALID_ARG;
    }

    const uint8_t idx = get_index(handle);
    if (idx == 0xFFU) {
        return HAL_ERR_INVALID_ARG;
    }

    // ADC DMA stream mapping
    DMA_TypeDef*        controller = s_adc_dma_map[idx].controller;
    DMA_Stream_TypeDef* stream     = s_adc_dma_map[idx].stream;
    const uint8_t       channel    = s_adc_dma_map[idx].channel;
    const uint8_t       stream_no  = s_adc_dma_map[idx].stream_no;
    const IRQn_Type     irq_type   = s_adc_dma_map[idx].irq_type;

    if (controller == NULL || stream == NULL) {
        return HAL_ERR_NOT_SUPPORTED;
    }

    // Clear all stale state before proceeding
    clear_state(handle, true, false);

    // Enable scan mode if we have more than one channel
    if (config->channels.num_of_channels > 1) {
        handle->CR1 |= ADC_CR1_SCAN;
    }

    // Set the number of channels/conversions in the L bit positions of the
    // SQR1 register. The L bit positions are zero indexed. That is, 2 channels
    // means an L value of 0b0001, 3 channels means an L value of 0b0010 etc.
    handle->SQR1 |= ((config->channels.num_of_channels - 1) << ADC_SQR1_L_Pos) & ADC_SQR1_L;

    for (size_t i = 0; i < config->channels.num_of_channels; i++) {
        // TODO: Set the channel sequence
        (void)config->channels.channels_sequence;
    }

    // Enable the DMA clock and disable the stream
    TRY(dmax_clk_enable(controller, true));
    TRY(dma_disable_stream(stream));

    // Clear the global DMA interrupt flags
    TRY(dma_clear_flags(controller, stream_no));

    // Configuration of the DMA stream
    dma_set_direction(stream, DMA_DIR_P_M);
    dma_set_direct_mode(stream, true);
    dma_set_channel(stream, channel);
    dma_set_increment(stream, false, true);
    dma_set_flow_controller(stream, true);
    dma_set_trans_length(stream, config->buffer_size);
    dma_set_stream_priority(stream, DMA_PRIORITY_HIGH);
    dma_set_per_mem_size(stream, DMA_SIZE_HWORD, DMA_SIZE_HWORD);

    const bool  double_buffering = config->use_double_buffers;
    const bool  circular_mode    = config->use_double_buffers || config->dma_wraparound_when_done;
    const void* buffer_2         = config->use_double_buffers ? config->buffer_2 : NULL;

    dma_enable_circm_dbm(stream, circular_mode, double_buffering);
    dma_set_addresses(stream, &handle->DR, config->buffer_1, buffer_2);

    // Enable ADC continuous sampling and DMA mode
    // Set the DDS bit only if we are in circular mode so the ADC continues
    // to send DMA requests even after the first buffer is filled.
    if (circular_mode) {
        handle->CR2 |= (ADC_CR2_CONT | ADC_CR2_DMA | ADC_CR2_DDS);
    } else {
        handle->CR2 |= (ADC_CR2_CONT | ADC_CR2_DMA);
    }

    // Clear the CT bit to ensure the DMA controller starts at the first buffer
    stream->CR &= ~DMA_SxCR_CT;

    // Callback registration
    const bool transfer_error    = config->callbacks.on_transfer_error != NULL;
    const bool direct_mode_error = config->callbacks.on_direct_mode_error != NULL;
    const bool transfer_complete = config->callbacks.on_buffer_full != NULL;
    const bool data_overrun      = config->callbacks.on_data_overrun != NULL;

    // Enable the interrupts based on what callbacks were passed
    dma_enable_irqs(stream, transfer_complete, transfer_error, false, direct_mode_error);
    if (data_overrun) {
        handle->CR1 |= ADC_CR1_OVRIE;
    }

    // Copy the registered callbacks
    __disable_irq();
    s_adc_ctx[idx].continuous_mode_callbacks = config->callbacks;
    __enable_irq();

    // Enable the DMA stream interrupts
    NVIC_SetPriority(irq_type, ADC_DMA_NVIC_IRQ_PRIORITY);
    NVIC_EnableIRQ(irq_type);

    // Enable the DMA stream after all DMA configuration is complete
    TRY(dma_enable_stream(stream));

    if (config->trigger == RG_TRIGGER_SOFTWARE) {
        // If the trigger is from software, set the SWSTART bit and return as that's all that's needed
        handle->CR2 |= ADC_CR2_SWSTART;
    } else {
        // Set the polarity of the trigger and the would be trigger source
        handle->CR2 |= (uint32_t)(config->trigger_polarity << ADC_CR2_EXTEN_Pos);
        handle->CR2 |= (uint32_t)(config->trigger << ADC_CR2_EXTSEL_Pos);
    }

    return HAL_OK;
}

hal_err_t adc_regular_group_cont_end_conv(ADC_TypeDef* handle) {
    const uint8_t idx = get_index(handle);
    if (idx == 0xFFU) {
        return HAL_ERR_INVALID_ARG;
    }

    // Stop the conversion by clearing the necessary bits
    clear_state(handle, true, false);

    // ADC DMA stream mapping
    DMA_TypeDef*        controller = s_adc_dma_map[idx].controller;
    DMA_Stream_TypeDef* stream     = s_adc_dma_map[idx].stream;
    const uint8_t       stream_no  = s_adc_dma_map[idx].stream_no;

    if (controller == NULL || stream == NULL) {
        return HAL_ERR_NOT_SUPPORTED;
    }

    // Then disable the stream, disable all interrupts and clear the interrupt flags
    TRY(dma_disable_stream(stream));
    TRY(dma_clear_flags(controller, stream_no));
    dma_enable_irqs(stream, false, false, false, false);

    // Clear all user passed callbacks
    __disable_irq();
    memset(&s_adc_ctx[idx].continuous_mode_callbacks, 0, sizeof(s_adc_ctx[idx].continuous_mode_callbacks));
    __enable_irq();

    return HAL_OK;
}


// For use with the injected group and external channels with interrupts
hal_err_t adc_injected_group_start_conv(ADC_TypeDef* handle, const adc_injected_group_config_t* config) {
    if (handle == NULL || config == NULL || config->channels.channels_sequence == NULL || config->channels.num_of_channels == 0 ||
        config->channels.num_of_channels > MAX_INJECTED_CHANNELS) {
        return HAL_ERR_INVALID_ARG;
    }

    const uint8_t idx = get_index(handle);
    if (idx == 0xFFU) {
        return HAL_ERR_INVALID_ARG;
    }

